Revit 2024 API
ColorWithTransparency.SetColor Method
 set color
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetColor(
	Color color
)
Visual Basic
Public Sub SetColor ( _
	color As Color _
)
Visual C++
public:
void SetColor(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
 color
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ColorWithTransparency Class
Autodesk.Revit.DB Namespace